servicemix-osgi/xslt/result-SelectChannelConnector.txt
Christian-Muellers-MacBook-Pro:xslt cmueller$ /usr/sbin/httpd2.4/bin/ab -n 5000 -c 20 -p 1K_buyStocks.xml -T text/xml http://localhost:8192/service/XSLTProxy
This is ApacheBench, Version 2.3 <$Revision: 1373084 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        Apache-Coyote/1.1
Server Hostname:        localhost
Server Port:            8192

Document Path:          /service/XSLTProxy
Document Length:        1505 bytes

Concurrency Level:      20
Time taken for tests:   3.713 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      8785000 bytes
Total body sent:        5850000
HTML transferred:       7525000 bytes
Requests per second:    1346.53 [#/sec] (mean)
Time per request:       14.853 [ms] (mean)
Time per request:       0.743 [ms] (mean, across all concurrent requests)
Transfer rate:          2310.41 [Kbytes/sec] received
                        1538.52 kb/s sent
                        3848.93 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.4      1      18
Processing:     2   13   3.7     13      46
Waiting:        0   12   3.7     12      43
Total:          2   15   3.5     14      48

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     15
  75%     15
  80%     16
  90%     19
  95%     21
  98%     25
  99%     27
 100%     48 (longest request)